src/cfe/InformationRegisters/кбп_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>кбп_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/кбп_ПроцессыСлужебный/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Значение настройки продукта из регистра кбп_Настройки или значение по умолчанию (ФТ-904).
//
// Параметры:
//  Ключ - Строка - ключ из НастройкиПоУмолчанию.
//
// Возвращаемое значение:
//  Произвольный
//
Функция Настройка(Ключ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.кбп_Настройки.СоздатьМенеджерЗаписи();
	Запись.Ключ = Ключ;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Значение = Запись.Значение.Получить();
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	Возврат НастройкиПоУмолчанию()[Ключ];

КонецФункции

// Записывает настройку продукта.
//
// Параметры:
//  Ключ - Строка
//  Значение - Произвольный
//
Процедура УстановитьНастройку(Ключ, Значение) Экспорт

	Запись = РегистрыСведений.кбп_Настройки.СоздатьМенеджерЗаписи();
	Запись.Ключ = Ключ;
	Запись.Значение = Новый ХранилищеЗначения(Значение);
	Запись.Записать();

КонецПроцедуры

// Ключи настроек и значения по умолчанию.
//
// Возвращаемое значение:
//  Соответствие - ключ → значение.
//
Функция НастройкиПоУмолчанию() Экспорт

	Настройки = Новый Соответствие;
	Настройки.Вставить("МаксимальнаяГлубинаВложенности", 20);
	Настройки.Вставить("СрокХраненияЖурналаДней", 0);
	Настройки.Вставить("ОтправлятьПочту", Истина);
	Настройки.Вставить("АдминистраторПроцессов", Неопределено);
	Возврат Настройки;

КонецФункции

#КонецОбласти
